{"config": {"name": "model_2", "layers": [{"name": "the_input", "config": {"name": "the_input", "sparse": false, "batch_input_shape": [null, 128, 64, 1], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "name": "conv1", "padding": "same", "activation": "relu", "trainable": true, "filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["the_input", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "maxpool1", "config": {"padding": "valid", "trainable": true, "name": "maxpool1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2", "padding": "same", "activation": "relu", "trainable": true, "filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["maxpool1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "maxpool2", "config": {"padding": "valid", "trainable": true, "name": "maxpool2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "reshape", "config": {"name": "reshape", "target_shape": [32, 256], "trainable": true}, "inbound_nodes": [[["maxpool2", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "dense1", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense1", "activation": "relu", "units": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Dense"}, {"name": "gru_1a", "config": {"bias_regularizer": null, "name": "gru_1a", "recurrent_constraint": null, "return_sequences": true, "activation": "tanh", "trainable": true, "recurrent_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 1, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "return_state": false, "go_backwards": false, "units": 512, "bias_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0}, "inbound_nodes": [[["dense1", 0, 0, {}]]], "class_name": "GRU"}, {"name": "gru_1b", "config": {"bias_regularizer": null, "name": "gru_1b", "recurrent_constraint": null, "return_sequences": true, "activation": "tanh", "trainable": true, "recurrent_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 1, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "return_state": false, "go_backwards": true, "units": 512, "bias_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0}, "inbound_nodes": [[["dense1", 0, 0, {}]]], "class_name": "GRU"}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["gru_1a", 0, 0, {}], ["gru_1b", 0, 0, {}]]], "class_name": "Add"}, {"name": "gru_2a", "config": {"bias_regularizer": null, "name": "gru_2a", "recurrent_constraint": null, "return_sequences": true, "activation": "tanh", "trainable": true, "recurrent_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 1, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "return_state": false, "go_backwards": false, "units": 512, "bias_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "GRU"}, {"name": "gru_2b", "config": {"bias_regularizer": null, "name": "gru_2b", "recurrent_constraint": null, "return_sequences": true, "activation": "tanh", "trainable": true, "recurrent_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 1, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "return_state": false, "go_backwards": true, "units": 512, "bias_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "GRU"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["gru_2a", 0, 0, {}], ["gru_2b", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dense2", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense2", "activation": "linear", "units": 23, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "softmax", "config": {"name": "softmax", "activation": "softmax", "trainable": true}, "inbound_nodes": [[["dense2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "the_labels", "config": {"name": "the_labels", "sparse": false, "batch_input_shape": [null, 8], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_length", "config": {"name": "input_length", "sparse": false, "batch_input_shape": [null, 1], "dtype": "int64"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "label_length", "config": {"name": "label_length", "sparse": false, "batch_input_shape": [null, 1], "dtype": "int64"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "ctc", "config": {"output_shape": [1], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\t\u0000\u0000\u0000C\u0000\u0000\u0000sY\u0000\u0000\u0000|\u0000\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000|\u0001\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0003\u0000\u0019}\u0001\u0000t\u0000\u0000j\u0001\u0000d\u0002\u0000|\u0002\u0000d\u0003\u0000|\u0001\u0000d\u0004\u0000|\u0003\u0000d\u0005\u0000|\u0004\u0000\u0083\u0000\u0004S)\u0006N\u00e9\u0002\u0000\u0000\u0000\u00da\u0006y_true\u00da\u0006y_pred\u00da\finput_length\u00da\flabel_length)\u0002\u00da\u0001K\u00da\u000ectc_batch_cost)\u0005\u00da\u0004argsr\u0003\u0000\u0000\u0000\u00da\u0006labelsr\u0004\u0000\u0000\u0000r\u0005\u0000\u0000\u0000\u00a9\u0000r\n\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-5e4161894f05>\u00da\u000fctc_lambda_func\u0001\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0002\u0012\u0003%\u0001", null, null], "arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "name": "ctc"}, "inbound_nodes": [[["softmax", 0, 0, {}], ["the_labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "class_name": "Lambda"}], "output_layers": [["ctc", 0, 0]], "input_layers": [["the_input", 0, 0], ["the_labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.9"}